// - Нам дано масив друзів let friends = ["Ivan", "Slavik", "Grisha" - Jeger maybe, "Lera", "Ira"]; Потрібно зробити перевірку якщо
// кількість елементів у масиві більше або дорівнює 3, то виводиться повідомлення про те, що це великий масив, в якому  3 і більше елементи.
//     Інакше слід вивести на екран повідомлення про те, що це маленький масив, в якому менше 3-х елементів.

let friends = ["Ivan", "Slavik", "Grisha", "Lera", "Ira"];
if (friends.length >= 3) {
    console.log("Це великий масив!")
} else {
    console.log('Це маленький масив в якому менше трьох елементів.')
}


// - Маємо 3 числа і між ним  нам потрібно знайти те що посередині.
//     Знайти, яке з них є середнім (більше одного, але менше за інше). Перевірити, чи знаходиться перше число між двома іншими.

let i = parseInt(prompt("Введіть перше число:"));
let j = parseInt(prompt("Введіть друге число:"));
let k = parseInt(prompt("Введіть третє число:"));
// At the moment like this I miss python so much ;_;
if ((i < k && k < j) || (j < k && k < i)) {
    console.log(`Число ${k} знаходиться між двома іншими`)
} else if ((k < i && i < j) || (j < i && i < k)) {
    console.log(`Число ${i} знаходиться між двома іншими`)
} else if ((k < j && j < i) || (i < j && j < k)) {
    console.log(`Число ${j} знаходиться між двома іншими`)
}



//  - Перепишіть конструкцію if з використанням умовного оператора '?':
//  let result;
//  if (a + b < 4) {
//     result = 'Мало';
//  } else {
//     result = 'Багато';
//  }
let a = 0;
let b = 0;
let result = (a + b < 4) ? "Мало" : "Багато";

// - Маємо будь яке число від -100 , 0 , +100 потрібно перевірити яким є число: позитивним, негативним або нулем
// напишіть це тернарним оператором

let c = parseInt(prompt('Enter a number between -100 - 100:'))
let number100 = (c > 0) ? "Позитивне" : (c < 0) ? "Негативне" : "Рівне нулю";
console.log(number100)

