// -     Користувач вводить або має два числа.
//     Потрібно знайти та вивести максимальне число з тих двох .
//     Також потрібно врахувати коли введені рівні числа.

let a = parseInt(prompt('Введіть перше ціле число: '));
let b = parseInt(prompt('Введіть друге ціле число: '));
if (a > b) {
    console.log(`Число ${a} - максимальне з двох даних чисел`);
} else if (a === b) {
    console.log('Числа є рівними!')
} else {
    console.log(`Число ${b} - максимальне з двох даних чисел`);
}


// - У першому під'їзді квартири з 1 до 20. У другому з 21 по 48. У третьому з 49 по 90.
// Користувач вводить номер квартири просто в змінні або через prompt('') .
//     Програма повинна зазначити, в якому під'їзді знаходиться дана квартира.

let apartmentNumber = parseInt(prompt('Введіть номер квартири'));

if (apartmentNumber) {
    if (apartmentNumber <= 20) {
        console.log("Квартира знаходить в першому під'їзді.");
    } else if (apartmentNumber <= 48 && apartmentNumber > 20) {
        console.log("Квартира знаходить в другому під'їзді.");
    } else if (apartmentNumber <= 90 && apartmentNumber > 48) {
        console.log("Квартира знаходить в третьому під'їзді.");
    }
}

//- Ми маємо змінну number в яку користувач задає числове значення,  якщо змінна рівна 10 вивести повідомлення ВІРНО, якщо змінна не рівна 10 - тоді НЕВІРНО

let number = parseInt(prompt('Введіть число'));
if (number === 10){
    console.log("ВІРНО");
} else {
    console.log("НЕВІРНО");
}

//- Ми маємо змінну x в яку користувач задає  значення,  якщо в змінну записане число, вивести 1,
// якщо в змінну записали стрінгу вивести 2, якщо булеве значення - 3, якщо об'єкт або масив - 4.
// якщо в змінну записали щось інше, спрацьовує else

let x = NaN; //Замініти на потрібне значення

if (typeof x === 'number'){
    console.log('1');
} else if (typeof x === 'string'){
    console.log('2');
} else if (typeof x === "boolean"){
    console.log(3);
} else if (typeof x === "object"){
    console.log(4);
} else {
    console.log("Ну і шо це таке?");
}


//- Задача-гра "чи ми йдемо сьогодні в OKTEN на навчання?".
// Змінна, яка характеризує температуру. Якщо температура від +10 до +22 вивести повідомлення що ми йдемо ВЧИТИСЯ .
// Якщо інша темпаретура, тоді виводимо повідомлення що сидимо вдома і вчимося ОНЛАЙН

let temperature = 20;

if (temperature < 22 && 10<temperature){
    console.log("Підйом!Топаємо на навчання!")
} else {
    console.log('Краще сиди вдома :)')
}

// - За допомогою switch case - реалізувати гру - вікторину, де ми вводимо число від 1 до 5. І взалежності від введеного
//     числа нам дається приз. (Авто, Мото, Телефон, і т.д ) і якщо число не підходить тоді  вивести Повідомлення - що число не вірне ... .

let lottery = parseInt(prompt("Введіть число від 1 до 5:"))

switch (lottery){
    case 1:
        console.log('Ти виграв шоколадку!');
        break;
    case 2:
        console.log('Ти виграв подорож!');
        break;
    case 3:
        console.log('Ти ніц не виграв :с');
        break;
    case 4:
        console.log('Ти виграв скриньку Пандори!');
        break;
    case 5:
        console.log('Ти виграв 100 грн.');
        break;
    default:
        console.log("Лишенько. Ти все зламав :(")
}